Fuentes/ficohsacore-vortex-7ebad6e8baaa/Middleware/v2/Resources/ConsultaFICOPEN/wsdl/consultaFICOPENPS.wsdl

<wsdl:definitions name="consultaFICOPENPS" targetNamespace="http://www.ficohsa.com.hn/middleware.services/consultaFICOPENPS/" xmlns:fic="http://www.ficohsa.com.hn/middleware.services/consultaFICOPENPS/" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:auth="http://www.ficohsa.com.hn/middleware.services/autType" xmlns:cons="http://www.ficohsa.com.hn/middleware.services/consultaFICOPENTypes">

	<wsdl:types>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/autType" schemaLocation="../../esquemas_generales/HeaderElements.xsd"/>
		</xsd:schema>
		<xsd:schema>
			<xsd:import namespace="http://www.ficohsa.com.hn/middleware.services/consultaFICOPENTypes" schemaLocation="../xsd/consultaFICOPENTypes.xsd"/>
		</xsd:schema>
	</wsdl:types>

	<wsdl:message name="consultaFICOPENRequest">
		<wsdl:part element="cons:consultaFICOPEN" name="parameters"/>
		<wsdl:part name="RequestHeader" element="auth:RequestHeader"/>
	</wsdl:message>
	<wsdl:message name="consultaFICOPENResponse">
		<wsdl:part element="cons:consultaFICOPENResponse" name="result"/>
		<wsdl:part name="ResponseHeader" element="auth:ResponseHeader"/>
	</wsdl:message>

	<wsdl:portType name="consultaFICOPENPS">
		<wsdl:operation name="consultaFICOPEN" parameterOrder="parameters RequestHeader ResponseHeader">
			<wsdl:input message="fic:consultaFICOPENRequest"/>
			<wsdl:output message="fic:consultaFICOPENResponse"/>
		</wsdl:operation>
	</wsdl:portType>

	<wsdl:binding name="consultaFICOPENPSSOAP" type="fic:consultaFICOPENPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="consultaFICOPEN">
			<soap:operation soapAction="http://www.ficohsa.com.hn/middleware.services/consultaFICOPENPS/consultaFICOPEN"/>
			<wsdl:input>
				<soap:body use="literal" parts="parameters"/>
				<soap:header message="fic:consultaFICOPENRequest" part="RequestHeader" use="literal"/>
			</wsdl:input>
			<wsdl:output>
				<soap:body use="literal" parts="result"/>
				<soap:header message="fic:consultaFICOPENResponse" part="ResponseHeader" use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>

	<wsdl:service name="consultaFICOPENPS">
		<wsdl:port binding="fic:consultaFICOPENPSSOAP" name="consultaFICOPENPSSOAP">
			<soap:address location="http://mwomnicanal:8003/Middleware/OperationsAndExecution/BundledProducts/consultaFICOPEN"/>
		</wsdl:port>
	</wsdl:service>

</wsdl:definitions>